quiz-g-back/app/Observers/QuizObserver.php

select * from `answers` where `answers`.`quiz_id` = 4 and `answers`.`quiz_id` is not null
select * from `contains` where `quiz_id` = 4
---
    public function deleting(Quiz $quiz){
        $quiz->answers()->get()->each->delete();
        Contain::where('quiz_id',$quiz->id)->get()->each->delete();