quiz-g-back/app/Http/Controllers/Admin/AdminController.php

select * from `collections` where `collections`.`id` in (2, 3, 4)
select * from `users` where `users`.`id` in (1, 2)
---
    public function allHistory(){
        $histories = $this->getAllHistory();
        $histories->load('collection');
        $histories->load('user');