quiz-g-back/app/Http/Controllers/CollectionController.php

    public function getCollectionByUser($user){
        $data = Collection::where('user_id',$user)->get();
        $data->load('user');
---
select * from `collections` where `user_id` = '1'
select * from `users` where `users`.`id` in (1)

    public function show($id)
    {
        $data = Collection::find($id,['id','user_id','name']);
        $data->setRelation('quizzes',$data->quizzes()->paginate(5));
---
select `quizzes`.*, `contains`.`collection_id` as `pivot_collection_id`, `contains`.`quiz_id` as `pivot_quiz_id` from `quizzes` inner join `contains` on `quizzes`.`id` = `contains`.`quiz_id` where `contains`.`collection_id` = 4 limit 5 offset 0
select count(*) as aggregate from `quizzes` inner join `contains` on `quizzes`.`id` = `contains`.`quiz_id` where `contains`.`collection_id` = 4