quiz-g-back/app/Http/Controllers/HistoryController.php

select * from `histories` where `user_id` = 2
---
    public function getHistory(){
        $histories = History::where('user_id',Auth::user()->id)->get();