quiz-g-back/app/Http/Controllers/QuizController.php

select * from `answers` where `answers`.`quiz_id` in (4)
---
    public function getQuizByUser($id){
        $quizzes = Quiz::where('user_id',$id)->get();
        if($quizzes == null || count($quizzes) <= 0){
            return response([
                'message' => 'Quiz not found or empty',
                'quizzes' => []
            ],400);
        }

        $quizzes = $quizzes->load('answers');

select * from `answers` where `answers`.`quiz_id` in (3, 4, 5, 6, 7, 8)
select * from `users` where `users`.`id` in (1)
---
    public function all(){
        $quizzes = Quiz::all();
        if($quizzes == null){
            return response([
                'message' => 'There is no quiz in the database',
                'quizzes' => []
            ],400);
        }
        $quizzes->load('answers');
        foreach($quizzes as $quiz){
            $quiz->authorize = (Auth::check() && Auth::user()->id == $quiz->user_id);
            $quiz->load('user');