quiz-g-back/app/Traits/AdminService.php

select * from `collections`
select * from `users` where `users`.`id` in (1, 2)
---
    public function getAllCollection(){
        $collections = Collection::all();
        $collections->load('user');

select * from `users` where `users`.`id` in (1)
---
    public function getAllQuiz(){
        $quizzes = Quiz::all();
        $quizzes->load('user');

select * from `users`
---
    public function getAllUser(){
        $users = User::all();

select * from `histories`
---
    public function getAllHistory(){
        $histories = History::all();

select `quizzes`.*, `contains`.`collection_id` as `pivot_collection_id`, `contains`.`quiz_id` as `pivot_quiz_id` from `quizzes` inner join `contains` on `quizzes`.`id` = `contains`.`quiz_id` where `contains`.`collection_id` in (4)
---
    public function showCollection($collection_id){
        $collection = Collection::findOrFail($collection_id);

        $collection->load('quizzes');

select * from `answers` where `answers`.`quiz_id` in (8)
select * from `users` where `users`.`id` in (1)
---
    public function showQuiz($id){
        $quiz = Quiz::findOrFail($id);

        $quiz->load('answers');
        $quiz->load('user');;

select * from `collections` where `user_id` = '1'
select * from `users` where `users`.`id` in (1)
---
    private function getCollectionByUser($id){
        $collections = Collection::where('user_id',$id)->get();

        $collections->load('user');

select * from `users` where `users`.`id` in (1)
---
    private function getQuizByUser($id){
        $quizzes = Quiz::where('user_id',$id)->get();

        $quizzes->load('user');

select * from `histories` where `user_id` = '1'
select * from `users` where `users`.`id` in (1)
select * from `collections` where `collections`.`id` in (2, 3)
---
    private function getHistoryByUser($id){
        $histories = History::where('user_id',$id)->get();

        $histories->load('user');
        $histories->load('collection');