quiz-g-back/app/Traits/QuizGHelper.php

select `quizzes`.*, `contains`.`collection_id` as `pivot_collection_id`, `contains`.`quiz_id` as `pivot_quiz_id` from `quizzes` inner join `contains` on `quizzes`.`id` = `contains`.`quiz_id` where `contains`.`collection_id` = 4 order by RAND()
select * from `answers` where `answers`.`quiz_id` = 8 and `answers`.`quiz_id` is not null order by RAND()
---
    public function getData($id){
        $data = $data = Collection::find($id);
        $data->setRelation('quizzes',$data->quizzes()->inRandomOrder()->get());
        foreach($data->quizzes as &$quiz){
            unset($quiz->correct_answer_id);
            $quiz->setRelation('answers',$quiz->answers()->inRandomOrder()->get());

update `histories` set `total` = 1, `correct` = 1, `finished` = 1, `total_time` = 5, `histories`.`updated_at` = '2020-01-06 09:35:45' where `id` = 31
---
    public function wrappingUp($history_id){
        $history = History::find($history_id);

        $history->finished = 1;
        $actions = $history->actions;

        $total = count($actions);
        $correct = 0;
        foreach($actions as $action){
            if($action->right == 1){
                $correct++;
            }
        }

        $history->total = $total;
        $history->correct = $correct;


        $history->save();

select * from `actions` where `actions`.`history_id` = 31 and `actions`.`history_id` is not null
---
    public function getHistory($history_id){
        $history = History::find($history_id);

        $sendback = $history->load('actions');